Revit 2024 API
EffectInstance Members
The EffectInstance type exposes the following members.
Constructors
Name | Description
EffectInstance
 Constructs the effect instance for geometry having the specified vertex format.
Methods
Name | Description
Dispose
Releases all resources used by the EffectInstance
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 Tests whether the effect instance is valid for rendering.
MatchesFormat
 Tests whether the effect instance is appropriate for the given vertex format.
SetAmbientColor
 Sets the ambient color parameter of the effect instance.
SetColor
 Sets the color parameter of the effect instance.
SetDiffuseColor
 Sets the diffuse color parameter of the effect instance.
SetEmissiveColor
 Sets the emissive color parameter of the effect instance.
SetGlossiness
 Sets the glossiness parameter of the effect instance.
SetSpecularColor
 Sets the specular color parameter of the effect instance.
SetTransparency
 Sets the transparency parameter of the effect instance.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace